{
  "backend/main.mo": "Actor canister handling inquiries, admin emails, and contact info with CRUD-like functions.",
  "feature_evidence.json": "Feature evidence report listing feature changes, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like list summarizing the purpose of each frontend file for reference.",
  "frontend/index.css": "Tailwind base setup defining OKLCH color variables, dark mode tokens, and global styles.",
  "frontend/index.html": "HTML entry point defining metadata, fonts, and mounting point for the React app.",
  "frontend/src/App.tsx": "Main React app wrapper configuring providers and rendering all page sections.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Floating WhatsApp action button linking to business contact number with tooltip.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing the business with three feature highlight cards.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form section handling validation, submission via a mutate hook, and displaying business contact info.",
  "frontend/src/components/sections/FooterSection.tsx": "Footer with business details, social links, quick navigation, and a smooth-scroll handler.",
  "frontend/src/components/sections/GallerySection.tsx": "Image gallery displaying project photos with modal previews using a dialog component.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, branding, stats, and quick action buttons for calling or contacting.",
  "frontend/src/components/sections/ServicesSection.tsx": "Service listing section showing multiple welding and fabrication services with icons and descriptions.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Section highlighting key reasons to choose the business, presented as a grid of bullet points.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with circular logo, smooth scrolling, and mobile menu.",
  "frontend/src/config/business.ts": "Defines business metadata including contact details, working hours, and social links.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity changes, invalidating dependent queries on updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity data, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation hook to submit inquiries through an actor and invalidates the inquiries query on success.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for an industrial dark theme with accent utilities and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, typography, and container settings using CSS variable‑driven design.",
  "project_state.json": "Stores project metadata, requirements, design notes, and features for building the SK Welding Works website."
}